Revit.Properties.Resources.AreaSchemeArgumentException
Looks up a localized string similar to You must supply an Area Scheme..

Revit.Properties.Resources.AttachedGroupLocation
Looks up a localized string similar to Cannot get location of attached group..

Revit.Properties.Resources.ChildElementsNotSupported
Looks up a localized string similar to Getting child elements is not supported for this type of Element..

Revit.Properties.Resources.CloseInputPolyCurveError
Looks up a localized string similar to The input PolyCurve is closed..

Revit.Properties.Resources.DocumentNotFamilyDocument
Looks up a localized string similar to Document is not a valid Family Document..

Revit.Properties.Resources.DocumentNotWorkshared
Looks up a localized string similar to Current Document is not workshared.

Revit.Properties.Resources.ElementTypeNameNotFound
Looks up a localized string similar to There is no ElementType of the given name in the current Document.

Revit.Properties.Resources.EmptyView
Looks up a localized string similar to Cannot place empty view on sheet..

Revit.Properties.Resources.EndPointListEmpty
Looks up a localized string similar to End point list is empty.

Revit.Properties.Resources.EndPointListHasNulls
Looks up a localized string similar to End point list contains null elements.

Revit.Properties.Resources.FamilyTypeDoesNotExist
Looks up a localized string similar to Family type does not exist in the document..

Revit.Properties.Resources.InvalidElementId
Looks up a localized string similar to Id is not a valid ElementId, GUID, string or int..

Revit.Properties.Resources.InvalidEndPointList
Looks up a localized string similar to Invalid end point list.

Revit.Properties.Resources.InvalidGroupType
Looks up a localized string similar to {0} is not a valid GroupType..

Revit.Properties.Resources.InvalidPathOfTravel
Looks up a localized string similar to Invalid PathOfTravel element..

Revit.Properties.Resources.InvalidStartPointList
Looks up a localized string similar to Invalid start point list..

Revit.Properties.Resources.InvalidSwitchJoinOrder
Looks up a localized string similar to Geometry join order can only be switched when the elements are already joined..

Revit.Properties.Resources.InvalidView
Looks up a localized string similar to Invalid view..

Revit.Properties.Resources.NoChildElements
Looks up a localized string similar to Element has no child Elements.

Revit.Properties.Resources.NoElementsToPurge
Looks up a localized string similar to No Elements to purge in the current document..

Revit.Properties.Resources.NonIntersectingElements
Looks up a localized string similar to Elements are not intersecting.

Revit.Properties.Resources.NoParentElement
Looks up a localized string similar to Element has no parent component.

Revit.Properties.Resources.NoStructuralMaterialAssigned
Looks up a localized string similar to FloorType has no structural material assigned.

Revit.Properties.Resources.NotBuiltInCategory
Looks up a localized string similar to Element not valid. Use an element from a BuiltInCategory..

Revit.Properties.Resources.NotHostElement
Looks up a localized string similar to Element is not a Host Element.

Revit.Properties.Resources.NotJoinedElements
Looks up a localized string similar to Cannot unjoin Elements that are not already joined..

Revit.Properties.Resources.NotPlanView
Looks up a localized string similar to The provided input view is not a plan view..

Revit.Properties.Resources.PointDataObsolete
Looks up a localized string similar to Use PointAnalysisDisplay.ByViewPointsAndValues instead..

Revit.Properties.Resources.RoomsForLongestPathNotFound
Looks up a localized string similar to Rooms are required to compute longest Paths of Travel..

Revit.Properties.Resources.StartEndListSizeMismatch
Looks up a localized string similar to Size of start point array doesn't match size of end point array.

Revit.Properties.Resources.StartPointListEmpty
Looks up a localized string similar to Start points list is empty.

Revit.Properties.Resources.StartPointListHasNulls
Looks up a localized string similar to Start point list contains null elements.

Revit.Properties.Resources.SurfaceDataObsolete
Looks up a localized string similar to Use FaceAnalysisDisplay.ByViewFacePointsAndValues instead..

Revit.Properties.Resources.VectorDataObsolete
Looks up a localized string similar to Use VectorAnalysisDisplay.ByViewPointsAndVectorValues instead..

Revit.Properties.Resources.ViewAlreadyPlacedOnSheet
Looks up a localized string similar to Cannot place view on sheet as it is already on a sheet..

Revit.Properties.Resources.ViewExportImageLockedError
Looks up a localized string similar to Attempt to override existing image failed due to file lock. Please make sure that image is not currently open in another application..

Revit.Properties.Resources.ViewPlan_ViewFamilyNotFound
Looks up a localized string similar to Specified View Type could not be found..

Revit.Properties.Resources.ViewUnsupportedScheduleType
Looks up a localized string similar to Provided Schedule Type is not supported..

Revit.Properties.Resources.WrongStorageType
Looks up a localized string similar to Input value for this parameter needs to be of type {0}..